# encoding=utf-8
import matplotlib
matplotlib.use('Agg')
import matplotlib.pyplot as plt
from pylab import *         #支持中文
# mpl.rcParams['font.sans-serif'] = ['SimHei']

names = ['0','1','2','3','4','5','6','7','8','9','10','11','12','13','14','15','16','17','18','19','20','21','22','23','24']
x = range(len(names))

acc_orig_attn = [
0.86631016,
0.86631016,
0.879679144,
0.871657754,
0.874331551,
0.863636364,
0.842245989,
0.834224599,
0.796791444,
0.834224599,
0.826203209,
0.820855615,
0.815508021,
0.815508021,
0.823529412,
0.754010695,
0.705882353,
0.815508021,
0.79144385,
0.679144385,
0.681818182,
0.673796791,
0.700534759,
0.631016043,
0.64973262,
] 

acc_orig_mlp = [
0.85828877,
0.85828877,
0.847593583,
0.855614973,
0.863636364,
0.879679144,
0.842245989,
0.86631016,
0.874331551,
0.839572193,
0.85828877,
0.868983957,
0.874331551,
0.842245989,
0.836898396,
0.836898396,
0.834224599,
0.807486631,
0.764705882,
0.743315508,
0.532085561,
0.532085561,
0.532085561,
0.532085561,
0.532085561,
] 

acc_orig_norm = [
0.585561497,
0.684491979,
0.644385027,
0.743315508,
0.796791444,
0.778074866,
0.770053476,
0.748663102,
0.713903743,
0.537433155,
0.762032086,
0.740641711,
0.655080214,
0.647058824,
0.743315508,
0.532085561,
0.532085561,
0.636363636,
0.625668449,
0.534759358,
0.585561497,
0.609625668,
0.537433155,
0.606951872,
0.532085561,
]

acc_sani_attn = [
0.862068966,
0.827586207,
0.84137931,
0.862068966,
0.868965517,
0.793103448,
0.717241379,
0.744827586,
0.765517241,
0.793103448,
0.8,
0.675862069,
0.620689655,
0.779310345,
0.751724138,
0.717241379,
0.786206897,
0.572413793,
0.696551724,
0.634482759,
0.613793103,
0.551724138,
0.551724138,
0.717241379,
0.524137931,
]

acc_sani_mlp = [
0.862068966,
0.862068966,
0.813793103,
0.793103448,
0.834482759,
0.84137931,
0.862068966,
0.889655172,
0.786206897,
0.875862069,
0.8,
0.772413793,
0.862068966,
0.855172414,
0.848275862,
0.820689655,
0.703448276,
0.765517241,
0.710344828,
0.551724138,
0.627586207,
0.544827586,
0.544827586,
0.482758621,
0.544827586,
]

acc_sani_norm = [
0.524137931,
0.55862069,
0.531034483,
0.751724138,
0.765517241,
0.779310345,
0.744827586,
0.751724138,
0.565517241,
0.64137931,
0.544827586,
0.689655172,
0.565517241,
0.544827586,
0.544827586,
0.55862069,
0.544827586,
0.544827586,
0.668965517,
0.544827586,
0.544827586,
0.544827586,
0.544827586,
0.634482759,
0.544827586,
]


plt.plot(x, acc_orig_attn, linewidth=1.0, label='U_orig/Attention')
plt.plot(x, acc_orig_mlp, linewidth=1.0, label='U_orig/MLP')
plt.plot(x, acc_orig_norm, linewidth=1.0, label='U_orig/LayerNorm')
plt.legend() # 让图例生效
plt.xticks(x, names, rotation=0)
plt.margins(0)
plt.xlabel("Number of higher MAE encoder blocks for re-initializing parts") #X轴标签
plt.ylabel("Accuracy") #Y轴标签
# plt.title("CXC_ft_IN1K_mae_pretrain_vit_large") #标题
plt.savefig('./linechart_attn_mlp_norm_CXClarge_reinit_orig.png')
plt.close()
plt.clf()

plt.plot(x, acc_sani_attn, linewidth=1.0, label='U_sani/Attention')
plt.plot(x, acc_sani_mlp, linewidth=1.0, label='U_sani/MLP')
plt.plot(x, acc_sani_norm, linewidth=1.0, label='U_sani/LayerNorm')
plt.legend() # 让图例生效
plt.xticks(x, names, rotation=0)
plt.margins(0)
plt.xlabel("Number of higher MAE encoder blocks for re-initializing parts") #X轴标签
plt.ylabel("Accuracy") #Y轴标签
# plt.title("CXC_ft_IN1K_mae_pretrain_vit_large") #标题
plt.savefig('./linechart_attn_mlp_norm_CXClarge_reinit_sani.png')
plt.close()
plt.clf()